/******************************************************************************
1. Създайте програма, която оценява едно цяло число дали представлява високосна година или не.

*******************************************************************************/

#include <iostream>
using namespace std;
int main()
{
    int a;
    cout<<"Enter number:"; cin>>a;
    if (a%100==0 && a%400!=0)
    {
         cout<<"Not a leap year";
    }
    if(a%400==0)
    {
        cout<<"leap year";
    }
    if (a%4==0 && a%100!=0)
    {
        cout<<"leap year";
    }
    if(a%4!=0)
    {
        cout<<"Not a leap year";
    }

    return 0;
}
